app/views/recipes/show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = 2
---
        <div class="form_header">Ingredients:</div>
        <% @recipe.ingredients.each do |i| %>

SELECT "steps".* FROM "steps" WHERE "steps"."recipe_id" = 1
---
        <div class="form_header">Steps:</div>
        <% @recipe.steps.each do |i| %>