app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        @recipes = Recipe.all

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
---
    def show
        @recipe = Recipe.find_all_by_id(params["id"])[0]
        if (params.has_key?(:delete))
            @recipe.destroy

SELECT "ingredients".* FROM "ingredients"
SELECT "steps".* FROM "steps"
---
    def new
        # render recipe creation form
        @ingredients = Ingredient.all
        @steps = Step.all

INSERT INTO "recipes" ("cook_time", "origin", "prep_time", "servings", "title") VALUES (?, ?, ?, ?, ?)  [["cook_time", 11], ["origin", "qweeee"], ["prep_time", 11], ["servings", 3], ["title", "qweeeee"]]
---
    def create
        @r = Recipe.create(params[:recipe])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "9"]]
UPDATE "recipes" SET "title" = 'Grilled Hamburgers goodshit' WHERE "recipes"."id" = 9
---
    def update
        @r = Recipe.find(params[:id])
        if @r.update_attributes(params[:recipe])